package wordseg

/**
  * Created by duanxiping on 2017/2/28.
  */
object Config {
  val vectorSize = 200
  //tag=B first name
  val firstName = Array("丁","万","丑","世","丘","丛","东","严","丰","丹","么","义","乌","乐","乔","乙","习","乾","于","云","亓","井","亢","京","仁","仇","仉","付","仝","代","令","仪","仰","仲","仵","任","伊","伍","伏","伟","伦","伯","何","佘","余","佟","侍","依","侯","保","俞","修","候","倪","傅","储","元","兆","党","全","公","兰","关","兴","冀","冉","冒","农","冠","冯","冰","况","冷","冼","凌","凤","刀","刁","刑","刘","刚","初","利","劉","力","励","劳","勾","包","匡","区","华","卓","单","南","卜","卞","占","卢","卫","印","危","卿","历","厉","厚","原","友","双","古","台","史","叶","吉","向","吕","启","吳","吴","呂","员","周","呼","咸","唐","商","喻","嘉","回","国","圣","堵","墨","夏","奕","奚","姚","姜","姬","威","娄","娟","婁","孔","孙","孝","孟","季","学","孫","宁","宇","安","宋","完","宓","宗","官","定","宛","宜","宝","宣","宦","宫","宮","容","宾","宿","寇","寒","寸","寿","封","尉","少","尔","尚","尤","尧","尹","居","屈","展","屠","山","岑","岳","崇","崔","嵇","巢","左","巩","巫","巴","布","帅","师","帥","席","常","平","年","幸","广","庄","庐","应","庚","庞","康","庹","庾","廉","廖","延","弘","张","弥","張","强","归","彭","徐","念","忻","怀","恽","惠","慈","慎","慕","戈","戎","成","战","戚","戴","房","扈","才","扬","扶","承","招","拜","揭","操","支","敏","敖","敬","文","斐","斯","方","施","时","旷","昂","昌","明","易","昝","星","晁","晋","晏","晓","普","景","智","曲","曹","曾","望","朝","木","朱","朴","权","李","杜","束","来","杨","杭","松","林","果","柏","查","柯","柳","柴","树","栗","栾","桂","桑","桓","梁","梅","梦","植","楚","楼","樊","欧","步","武","段","殷","毋","母","毕","毛","水","永","汉","汝","江","池","汤","汪","汲","沃","沈","沐","沙","泉","泰","洛","洪","浦","海","涂","淦","清","渠","温","游","湛","滑","滕","满","漆","潘","潭","濮","炎","焦","熊","燕","牛","牟","牧","狄","独","玄","玉","王","班","琼","瑞","甄","甘","田","申","畅","疏","白","皇","皮","益","盖","盘","盛","相","真","眭","睢","瞿","矫","石","碧","祁","祖","祝","禄","福","禚","禹","禾","秋","秘","秦","程","稽","穆","窦","章","童","竹","竺","符","简","管","籍","米","粟","糜","素","索","紫","綦","纪","练","绍","经","续","缪","罗","羅","羊","羽","翁","翟","翦","考","耿","聂","肇","肖","胡","胥","脱","腾","臧","舍","舒","良","艾","芦","芮","花","苍","苏","苑","苗","苟","英","茂","范","茅","茆","茹","荀","荆","荣","莫","菅","萧","萨","葛","董","蒋","蒙","蒯","蒲","蒿","蓝","蔚","蔡","蔺","薄","薛","虞","虢","蚩","衡","衣","衷","袁","袭","裔","裘","裴","褚","西","覃","解","言","訾","詹","謝","计","许","诸","诺","谈","谌","谢","谭","谷","貂","贝","贞","贡","贲","贵","费","贺","贾","赖","赛","赤","赫","赵","路","蹇","车","辛","辜","边","运","连","迟","逄","逢","逯","遇","邓","邝","邢","那","邬","邰","邱","邴","邵","邸","邹","郁","郎","郏","郑","郗","郜","郝","郦","郭","都","鄂","鄢","鄧","释","金","鐘","钟","钮","钱","铁","银","關","门","闪","闫","闭","闵","闻","闽","闾","阎","阙","阚","阮","阳","阴","阿","陆","陈","陳","陶","隆","隋","雍","雷","霍","青","靖","靳","鞠","韋","韓","韦","韩","项","须","顾","顿","颖","颜","风","饶","马","骆","高","魏","鱼","鲁","鲍","鹿","麦","麻","黄","黎","齐","龙","龚")

  // tag=F name prefix
  val nrPrefix = Array("小","老","阿")

  // tag=G name suffx
  val nrSuffix = Array("公","哥","四","小姐","女士","先生","大爷","爷","姐","总","教授","某","氏","老","老师","经理","医生","氏","妈","爸")

  // tag=A nr stop words
  val nrStopWords = Array("一栏","三种","传发","全部在","关键年","剑市","力而","加分","区人保","区府","区新闻","区迎世","原校无","含区","和世博","和新建","回本市","小结","年七至","开好","我","方可由","方式加","本区","权重和","爱我","盖公章","谈明星","路亭棚","阳光之","阴超","须加盖","马拉","高者多","汪洋张","可在","可经","二字","可刷","百克","有多","三类","全为","其妻","日在","金梨之","花节邀","节邀","花节","梨之","百米","都具","千名","阿两国","那就","万余元","钱是","应对其","方就其","方就","微智","途歌","曾两度","曾两","帅比萌","万余","帅成","双头","满六","高分","钱是","方就其","小鬼","毛和他","总资","易欢欢","都在","管好钱","金将","力涨","途歌","钟就","原车","米堆","山尖","修来世","康巴小","万亩","海或","金刚手","海五","段就","山以","小车","丰俭由","都行","高原多","司概","全陪","戴上","季调","盘时段","曾两度","鹿晗暖","帅比萌","白三种","植毛","那一站","欧元又","全麦","四席","平亦凡","华两","车锁","全國","凝刀","修復","智源","康復治","步落","普刀","展以","安全化","昇服","關於各","吉華路","四款","姜黄之","年至","保姆","闪淘","抗炎","万有","紫御","方式来","欧美元","欧道路","义旺","四岁","时许他","那还得","宝妈","纽元","年率","逢高","才得真","欧元欧","年或","时由","华丽地","那与","龙与凤","花开","鱼和水","欧对")

  // ns stop words, 还没有根据ns.txt进行选择
  val nsStopWords = Array("路","市","区","县","省","镇","村","乡")

  val otherStopWords = Array("这是")

  //val nWords = Array("金服","贵圈","牛熊","满仓","全仓","国庆","黄金周","盘中","劳顾会","鹰鸽")
  //val nrWords = Array("习近平")
}
